console.log(`

Score: 160 / 160

✅ Слайдер в секции Welcome +24
✅ Слайдер в секции Video +20
✅ Кастомный видеоплеер +36
✅ Слайдер сравнения изображений в секции Explore +10
✅ Анимация при прокрутке изображений в секции Galery +8
✅ Калькулятор продажи билетов в секции Tiskets +10
✅ Калькулятор продажи билетов в форме продажи билетов +14
✅ Валидация формы +16
✅ Интерактивная карта в секции Contacts +12
✅ Любой собственный дополнительный функционал +10

Дополнительный функционал: 
1) При скролле вниз header исчезает, при скролле вверх - появляется
2) Кнопка сброса формы покупки билетов "Reset": очищаются все поля и local storage
3) Анимация всплытия галереи работает не только при скролле вниз, но и наверх
4) Валидация данных карты: 
 - принимает только Mastercard (например: 5425233430109903) и Visa (4263982640269299)
 - expiration date не может быть в прошлом и не более трех лет в будущем
 - валидация cardholder (три буквы минимум, между словами пробел)
5) Сабмит формы:
- при нажатии на кнопку "Book" в неправильно заполненной форме отображаются ошибки
- если форма заполнена правильно поля очищаются, модальное окно исчезает и появляется сообщение об успешном заполнении`)