console.log(`


Дополнительный функционал: 
1) При скролле вниз header исчезает, при скролле вверх - появляется
2) Кнопки сброса формы покупки билетов в секции Tickets и popup. Очищаются все поля и local storage
3) Анимация всплытия галереи работает не только при скролле вниз, но и наверх
4) Валидация данных карты: принимает только Mastercard (например: 5425233430109903) и Visa (4263982640269299), expiration date не может быть в прошлом и не более трех лет в будущем, валидация имени и фамилии (три буквы минимум, между ними пробел)`)